Documents/Премия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Премия</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>CalculationRegister.Начисления</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательРасчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Премия/Forms/ФормаДокумента/Ext/Form/Module.bsl
//&НаКлиенте
//Процедура НачисленияВидРасчетаПриИзменении(Элемент)


//	ТекДанные = Элементы.Начисления.ТекущиеДанные;
//	ДатаНачисления = Объект.ПериодНачисления;
//	ПоказательРасчета = ПродажиСотрудников(ТекДанные.Сотрудник, ТекДанные.ВидРасчета, ДатаНачисления);
//	ТекДанные.ПоказательРасчета = ПоказательРасчета;

//КонецПроцедуры


//&НаСервереБезКонтекста
//Функция ПродажиСотрудников(Сотрудник, ВидРасчета, ПериодНачисления)
//	Если
//		ВидРасчета = ПланыВидовРасчета.Начисления.НайтиПоНаименованию("Премия процент от продаж")Тогда 
//		
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ПродажиОбороты.Сотрудник КАК Сотрудник,
//		|	ПродажиОбороты.СуммаОборот КАК ПоказательРасчета
//		|ИЗ
//		|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , Сотрудник = &Сотрудник) КАК ПродажиОбороты";
//		
//		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодНачисления));
//		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодНачисления));
//		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
//		
//		РезультатЗапроса = Запрос.Выполнить();
//		Если РезультатЗапроса.Пустой() Тогда 
//			Возврат 0;
//		КонецЕсли;
//		
//		Выборка = РезультатЗапроса.Выбрать();
//		Выборка.Следующий();
//		
//		Возврат Выборка.ПоказательРасчета;
//	Иначе 
//		Возврат Неопределено
//	КонецЕсли;


//КонецФункции // ПродажиСотрудников()

&НаСервере
Процедура ЗаполнитьДанныеПоПродажамНаСервере()
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиОбороты.Сотрудник КАК Сотрудник,
		|	ПродажиОбороты.СуммаОборот КАК ПоказательРасчета
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ПродажиОбороты";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ПериодНачисления));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодНачисления));
		
		РезультатЗапроса = Запрос.Выполнить();
		ТексСтр = РезультатЗапроса.Выгрузить();
		
		Объект.Начисления.Загрузить(ТексСтр);
		
	Для Каждого СтрокаТЧ из Объект.Начисления цикл
		СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.Начисления.НайтиПоНаименованию("Премия процент от продаж"); 
	КонецЦикла;
	
	Объект.Начисления.Сортировать("Сотрудник");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоПродажам(Команда)
	ЗаполнитьДанныеПоПродажамНаСервере();
КонецПроцедуры
